---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainer.GetHostId
source: html/da5694c7-b1bb-6155-47f9-93b0b61776ea.htm
---
# Autodesk.Revit.DB.Structure.RebarContainer.GetHostId Method

The element that contains the rebar.

## Syntax (C#)
```csharp
public ElementId GetHostId()
```

## Returns
The element that the rebar object belongs to, such as a structural
 wall, floor, foundation, beam, brace or column.